{
    // Whether to hide the QSS save button.
    // `true` if the button should be hidden and `false` otherwise.
    hideQssSaveButton: false,

    // Configuration options for the QSS window
    qss: {
        // Determines if the QSS will be shown automatically on Morphic's startup
        showQssOnStart: false,

        // Defines the delay in milliseconds before the tooltip is shown after a QSS button is selected
        tooltipDisplayDelay: 500, // ms

        // The scaling factor for the QSS
        scaleFactor: 1.2,
        urls: {
            account: "http://morphic.world/account",
            cloudFolder: "https://drive.google.com/drive/folders/11m-AKdP-0wjEBocpVtvnK8iE23P7hFTS"
        },

        alwaysUseChrome: false,

        // The template that is used for every label of the language setting's options.
        // The "%" followed by a word specifies a variable and there are three possible variables:
        // - native - the name of the language in its native form
        // - local - the name of the language in the currently applied language
        // - english - the name of the of the language in English
        languageOptionLabel: {
            currentLanguageGroup: "%native",
            genericLanguage: "%native · %local"
        },
        // The code of OS default language `gpii-app` (it might be the one with which the system was installed with).
        // This language should always stay on top of the "Language" setting's menu list.
        // The code must be exactly matching one of the installed languages' code (with respect to the region).
        // In case the selected language code is missing, there simply won't be a special first setting.
        // NOTE: this is not related to the default language value defined for the language setting
        systemDefaultLanguage: "en-US",
        messages: {
            keyedOut: "To save you must insert a Morphic Key. Please ask for one at the Front Desk. If you have a key inserted and you see this message, remove the key and re-insert it, then you can Save."
        },

        // The path to the ShareX's executable file, used in the screenCaptureWidget.
        // This is the path where ShareX lives after installing Morphic. Can be adjusted for development purposes.
        shareXPath: "C:\\Program Files (x86)\\Morphic\\sharex\\sharex-portable\\sharex.exe",

        // list of the desired list of buttons shown in QSS
        // it uses the `id` attribute found in settings.json items
        buttonList: [
            "language",
            "translate-tools",
            "separator",
            "screen-zoom",
            "text-zoom",
            "separator",
            "screen-capture",
            "office-simplification",
            "high-contrast",
            "read-aloud",
            "volume",
            "separator",
            "launch-documorph",
            "cloud-folder-open",
            "usb-open",
            "separator-visible",
            "service-more",
            "service-save",
            "service-undo",
            "service-dummy",
            "service-reset-all",
            "service-close"
        ],

        // The path to the DocuMorph's executable file, used in the service buttons.
        // This is the path where DocuMorph lives after installing Morphic. Can be adjusted for development purposes.
        docuMorphExecutable: "C:\\Program Files (x86)\\Morphic\\documorph\\DocuMorph.Widget.exe"
    },

    // Whether to hide the QSS when a user clicks outside of it
    closeQssOnClickOutside: true,

    // Whether to disable the displaying of notifications that suggest some
    // applications may need to be restarted in order for a changed setting to be
    // fully applied. An example for such setting is `Language`.
    // If set to `true`, such notifications will NOT be displayed.
    disableRestartWarning: true,

    // The shortcut that open the QSS. For posible values refer to: https://electronjs.org/docs/api/accelerator
    openQssShortcut: "Shift+Ctrl+AltOrOption+SuperOrCmd+M",

    // Configuration options for the QSS More panel
    qssMorePanel: {
        // These are default values. The actual dimensions of the QSS more panel
        // are qssScaleFactor * defaultWidth and qssScaleFactor * defaultHeight.
        defaultWidth: 600,
        defaultHeight: 450,
        movable: true,
        resizable: true,
        alwaysOnTop: true,

        urls: {
            moreInfo: "http://morphic.world/more"
        }
    },

    // Configuration options for the About dialog
    aboutDialog: {
        urls: {
            morphicHome: "https://morphic.world",
            submitSuggestions: "mailto:suggestions@morphic.world"
        }
    },

    // URL to the the place serving the survey triggers data. Note that it should return triggers in JSON format
    surveyTriggersUrl: "http://survey.gpii.net/survey-triggers.json",

    // The type of widget to use in the task bar - "gpii.app.trayButton", "gpii.app.trayIcon", or both.
    trayType: ["gpii.app.trayButton"]
}
